simulation/constant/thermoProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermoProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//-- Phase Diagram Information
Tmelt	[0 0 0 1 0 0 0]   1357.77; // Температура плавления
Teut	[0 0 0 1 0 0 0]   1090.00; // Температура эвтектики
Tiso    [0 0 0 1 0 0 0]   0.4; // Фракция изотермического отвердевания

Calpha	[0 0 0 0 0 0 0]   0.03; // Состав при образовании альфа-фазы
Ceut    [0 0 0 0 0 0 0]   0.20; // Эвтектический состав

L       [0 2 -2 0 0 0 0]  2.05e5; // Латентная теплота (теплота фазового перехода)

// ************************************************************************* //
