simulation/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (solid liquid);

solid
{
    rho     8960;
    Cp      385;
    kappa   401;
    mu      1.8e-3;
    D       1e-9;
    DAS     1e-5;
}

liquid
{
    rho     8020;
    Cp      420;
    kappa   320;
    mu      4.5e-3;
    D       2e-9;

    betaT   1.7e-4;
    betaC   0.4;
    TRef    1300;
    CRef    0.02;
}

// ************************************************************************* //
